DopleZZ/embedded-systems/fitocube-low/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"
CONFIG_SOIL_SENSOR_ADC_CH6=y
CONFIG_SOIL_SENSOR_SAMPLE_PERIOD_MS=1000
CONFIG_SOIL_SENSOR_SOIL_DRY_RAW=1200
CONFIG_SOIL_SENSOR_SOIL_WET_RAW=3200
CONFIG_SOIL_SENSOR_VREF_MV=1100
CONFIG_SOIL_SENSOR_WIFI_SSID="iPhone (Evgeniy)"
CONFIG_SOIL_SENSOR_WIFI_PASSWORD="mep228330"
CONFIG_SOIL_SENSOR_MQTT_BROKER_URI="mqtt://azat222.ru:1883"
CONFIG_SOIL_SENSOR_MQTT_CMD_TOPIC="soil/cmd"
CONFIG_SOIL_SENSOR_MQTT_DATA_TOPIC="soil/data"
CONFIG_SOIL_SENSOR_PUBLISH_INTERVAL_MS=300000
CONFIG_SOIL_SENSOR_BME280_ENABLED=y
CONFIG_SOIL_SENSOR_BME280_SDA=21
CONFIG_SOIL_SENSOR_BME280_SCL=22
CONFIG_SOIL_SENSOR_BME280_I2C_ADDRESS=0x76
